#define  _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main()
//{
//	//int a = 5 / 2;//商2余1
//	double a = 5 / 2.0;//2.500000
//	printf("a=%lf\n", a);
//	return 0;
//}
//int main()
//{
//	int a = 16;
//	//int a = -1;
//	//>>--右移操作符 移动的是二进制位
//	//00000000000000000000000000010000
//	int b = a >> 1;//算术右移
//	printf("%d\n", b);
//	return 0;
//}
//int main()
//{
//	int a = -1;
//	//整数的二进制表示有：原码、反码、补码
//	//存储到内存的是补码
//	//100000000000000000000000000001-原码
//	//111111111111111111111111111110-反码 -符号位不变，其他位取反
//	//111111111111111111111111111111-补码-反码+1
//	//
//	//>>--右移操作符 移动的是二进制位
//	int b = a >> 1;//算术右移
//	printf("%d\n", b);//-1右移还是-1
//	return 0;
//}
//int main()
//{
//	int a = 5;
//	int b = a<<1;//算术左移*2
//	//
//	printf("%d\n", b);//-1右移还是-1
//	return 0;
//}
//int main()
//{
//	//&-按2进制位与
//	/*int a = 3;
//	int b = 5;
//	int c = a&b;*/
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//000000000000000000000000000000001-按位与 1
//	//|-按2进制位或
//	/*int a = 3;
//	int b = 5;
//	int c = a | b;*/
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000111-7
//	//按2进制位异或
//	//相同为0，相异为1
//	int a = 3;
//	int b = 5;
//	int c = a^b;
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000110-6
//	printf("%d\n", c);
//	return 0;
//}
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//int tmp = 0;
//	printf("before:a = %d, b = %d\n", a, b);
//	////加减法-可能会溢出
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	//异或的方法
//	a = a^b;
//	b = a^b;
//	a = a^b;
//	printf("after:a = %d, b = %d\n", a, b);
//	return 0;
//}
//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);//-1不行
//	//统计num的补码中有几个1
//	/*while (num)
//	{
//		if (num % 2 == 1)
//			count++;
//		num = num / 2;
//	}*/
//	int i = 0;
//	for ( i = 0; i < 32; i++)
//	{
//		if (1==((num>>i)&1))
//		{
//			count++;
//		}
//	}
//	printf("%d\n", count);
//	return 0;
//}
int main()
{
	int a = 10;
	//int* p = &a;//取地址操作符
	//*p = 20;//解引用操作符
	//printf("%d\n", a);
	//sizeof-计算的是变量所占内存空间的大小，单位是字节
	char c = 'r';
	char* p = &c;
	int arr[10] = { 0 };
	printf("%d\n", sizeof(a));//4
	printf("%d\n", sizeof(int ));//4

	printf("%d\n", sizeof(c));//1
	printf("%d\n", sizeof(char));//1

	printf("%d\n", sizeof(p));//4
	printf("%d\n", sizeof(char*));//4

	printf("%d\n", sizeof(arr));//40
	printf("%d\n", sizeof(int [5]));//40
	return 0;
}